Autodesk.Revit.DB.Mechanical.WaterLoopData.IsDataCompleted
is the required data completed for this water loop?
Since:
2020

Autodesk.Revit.DB.Mechanical.WaterLoopData.CondenserWaterLoopId
The water loop element id for the water cooled chiller.
Since:
2020

Autodesk.Revit.DB.Mechanical.WaterLoopData.ChillerType
The type of water chiller. Note this property change would reset the condenser water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.WaterLoopData.WaterLoopType
The type of water loop. Note this property change would reset other properties.
Since:
2020

Autodesk.Revit.DB.Mechanical.WaterLoopData
Represents the data and parameters of analytical water loop.
Since:
2020